#include"temp.h"
#include"lcd.h"
#include"interface.h"

uchar CNCHAR[6] = "ÉãÊÏ¶È";
/*******************************************************************************
* º¯ÊıÃû         : Delay1ms
* º¯Êı¹¦ÄÜ		   : ÑÓÊ±º¯Êı
* ÊäÈë           : ÎŞ
* Êä³ö         	 : ÎŞ
*******************************************************************************/

void Delay1ms(unsigned int y)
{
	unsigned int x;
	for(y;y>0;y--)
		for(x=110;x>0;x--);
}
/*******************************************************************************
* º¯ÊıÃû         : Ds18b20Init
* º¯Êı¹¦ÄÜ		   : ³õÊ¼»¯
* ÊäÈë           : ÎŞ
* Êä³ö         	 : ³õÊ¼»¯³É¹¦·µ»Ø1£¬Ê§°Ü·µ»Ø0
*******************************************************************************/

unsigned char Ds18b20Init()
{
	unsigned int i;
	DSPORT=0;			 //½«×ÜÏßÀ­µÍ480us~960us
	i=70;	
	while(i--);//ÑÓÊ±642us
	DSPORT=1;			//È»ºóÀ­¸ß×ÜÏß£¬Èç¹ûDS18B20×ö³ö·´Ó¦»á½«ÔÚ15us~60usºó×ÜÏßÀ­µÍ
	i=0;
	while(DSPORT)	//µÈ´ıDS18B20À­µÍ×ÜÏß
	{
		i++;
		if(i>5000)//µÈ´ı>5MS
			return 0;//³õÊ¼»¯Ê§°Ü	
	}
	return 1;//³õÊ¼»¯³É¹¦
}

/*******************************************************************************
* º¯ÊıÃû         : Ds18b20WriteByte
* º¯Êı¹¦ÄÜ		   : Ïò18B20Ğ´ÈëÒ»¸ö×Ö½Ú
* ÊäÈë           : com
* Êä³ö         	 : ÎŞ
*******************************************************************************/

void Ds18b20WriteByte(unsigned char dat)
{
	unsigned int i,j;
	for(j=0;j<8;j++)
	{
		DSPORT=0;			//Ã¿Ğ´ÈëÒ»Î»Êı¾İÖ®Ç°ÏÈ°Ñ×ÜÏßÀ­µÍ1us
		i++;
		DSPORT=dat&0x01; //È»ºóĞ´ÈëÒ»¸öÊı¾İ£¬´Ó×îµÍÎ»¿ªÊ¼
		i=6;
		while(i--); //ÑÓÊ±68us£¬³ÖĞøÊ±¼ä×îÉÙ60us
		DSPORT=1;	//È»ºóÊÍ·Å×ÜÏß£¬ÖÁÉÙ1us¸ø×ÜÏß»Ö¸´Ê±¼ä²ÅÄÜ½Ó×ÅĞ´ÈëµÚ¶ş¸öÊıÖµ
		dat>>=1;
	}
}
/*******************************************************************************
* º¯ÊıÃû         : Ds18b20ReadByte
* º¯Êı¹¦ÄÜ		   : ¶ÁÈ¡Ò»¸ö×Ö½Ú
* ÊäÈë           : com
* Êä³ö         	 : ÎŞ
*******************************************************************************/


unsigned char Ds18b20ReadByte()
{
	unsigned char byte,bi;
	unsigned int i,j;	
	for(j=8;j>0;j--)
	{
		DSPORT=0;//ÏÈ½«×ÜÏßÀ­µÍ1us
		i++;
		DSPORT=1;//È»ºóÊÍ·Å×ÜÏß
		i++;
		i++;//ÑÓÊ±6usµÈ´ıÊı¾İÎÈ¶¨
		bi=DSPORT;	 //¶ÁÈ¡Êı¾İ£¬´Ó×îµÍÎ»¿ªÊ¼¶ÁÈ¡
		/*½«byte×óÒÆÒ»Î»£¬È»ºóÓëÉÏÓÒÒÆ7Î»ºóµÄbi£¬×¢ÒâÒÆ¶¯Ö®ºóÒÆµôÄÇÎ»²¹0¡£*/
		byte=(byte>>1)|(bi<<7);						  
		i=4;		//¶ÁÈ¡ÍêÖ®ºóµÈ´ı48usÔÙ½Ó×Å¶ÁÈ¡ÏÂÒ»¸öÊı
		while(i--);
	}				
	return byte;
}
/*******************************************************************************
* º¯ÊıÃû         : Ds18b20ChangTemp
* º¯Êı¹¦ÄÜ		   : ÈÃ18b20¿ªÊ¼×ª»»ÎÂ¶È
* ÊäÈë           : com
* Êä³ö         	 : ÎŞ
*******************************************************************************/

void  Ds18b20ChangTemp()
{
	Ds18b20Init();
	Delay1ms(1);
	Ds18b20WriteByte(0xcc);		//Ìø¹ıROM²Ù×÷ÃüÁî		 
	Ds18b20WriteByte(0x44);	    //ÎÂ¶È×ª»»ÃüÁî
//	Delay1ms(100);	//µÈ´ı×ª»»³É¹¦£¬¶øÈç¹ûÄãÊÇÒ»Ö±Ë¢×ÅµÄ»°£¬¾Í²»ÓÃÕâ¸öÑÓÊ±ÁË
   
}
/*******************************************************************************
* º¯ÊıÃû         : Ds18b20ReadTempCom
* º¯Êı¹¦ÄÜ		   : ·¢ËÍ¶ÁÈ¡ÎÂ¶ÈÃüÁî
* ÊäÈë           : com
* Êä³ö         	 : ÎŞ
*******************************************************************************/

void  Ds18b20ReadTempCom()
{	

	Ds18b20Init();
	Delay1ms(1);
	Ds18b20WriteByte(0xcc);	 //Ìø¹ıROM²Ù×÷ÃüÁî
	Ds18b20WriteByte(0xbe);	 //·¢ËÍ¶ÁÈ¡ÎÂ¶ÈÃüÁî
}
/*******************************************************************************
* º¯ÊıÃû         : Ds18b20ReadTemp
* º¯Êı¹¦ÄÜ		   : ¶ÁÈ¡ÎÂ¶È
* ÊäÈë           : com
* Êä³ö         	 : ÎŞ
*******************************************************************************/

int Ds18b20ReadTemp()
{
	int temp=0;
	unsigned char tmh,tml;
	Ds18b20ChangTemp();			 	//ÏÈĞ´Èë×ª»»ÃüÁî
	Ds18b20ReadTempCom();			//È»ºóµÈ´ı×ª»»Íêºó·¢ËÍ¶ÁÈ¡ÎÂ¶ÈÃüÁî
	tml=Ds18b20ReadByte();		//¶ÁÈ¡ÎÂ¶ÈÖµ¹²16Î»£¬ÏÈ¶ÁµÍ×Ö½Ú
	tmh=Ds18b20ReadByte();		//ÔÙ¶Á¸ß×Ö½Ú
	temp=tmh;
	temp<<=8;
	temp|=tml;
	return temp;
}

/*******************************************************************************
* º¯ÊıÃû         : LcdDisplay()
* º¯Êı¹¦ÄÜ		   : LCDÏÔÊ¾¶ÁÈ¡µ½µÄÎÂ¶È
* ÊäÈë           : v
* Êä³ö         	 : ÎŞ
*******************************************************************************/

void LcdDisplay(int temp) 	 //lcdÏÔÊ¾
{
    
  	unsigned char i, datas[] = {0, 0, 0, 0, 0}; //¶¨ÒåÊı×é
	float tp;  
	if(temp< 0)				//µ±ÎÂ¶ÈÖµÎª¸ºÊı
  	{
	  	LcdWriteCom(0x80 + star_add + 0x08);		//Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
		  SBUF='-';//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
		  while(!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
		  TI=0;						 //Çå³ı·¢ËÍÍê³É±êÖ¾Î»
	      LcdWriteData('-');  		//ÏÔÊ¾¸º
		  //ÒòÎª¶ÁÈ¡µÄÎÂ¶ÈÊÇÊµ¼ÊÎÂ¶ÈµÄ²¹Âë£¬ËùÒÔ¼õ1£¬ÔÙÈ¡·´Çó³öÔ­Âë
		  temp=temp-1;
		  temp=~temp;
		  tp=temp;
		  temp=tp*0.0625*100+0.5;	
		  //ÁôÁ½¸öĞ¡Êıµã¾Í*100£¬+0.5ÊÇËÄÉáÎåÈë£¬ÒòÎªCÓïÑÔ¸¡µãÊı×ª»»ÎªÕûĞÍµÄÊ±ºò°ÑĞ¡Êıµã
		  //ºóÃæµÄÊı×Ô¶¯È¥µô£¬²»¹ÜÊÇ·ñ´óÓÚ0.5£¬¶ø+0.5Ö®ºó´óÓÚ0.5µÄ¾ÍÊÇ½ø1ÁË£¬Ğ¡ÓÚ0.5µÄ¾Í
		  //ËãÓÉÏ0.5£¬»¹ÊÇÔÚĞ¡ÊıµãºóÃæ¡£
      
  	}
 	else
  	{			
	  	LcdWriteCom(0x80 + star_add + 0x08);		//Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	    LcdWriteData('+'); 		//ÏÔÊ¾Õı
		SBUF='+';//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
		while(!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
		TI=0;						 //Çå³ı·¢ËÍÍê³É±êÖ¾Î»
		tp=temp;//ÒòÎªÊı¾İ´¦ÀíÓĞĞ¡ÊıµãËùÒÔ½«ÎÂ¶È¸³¸øÒ»¸ö¸¡µãĞÍ±äÁ¿
		//Èç¹ûÎÂ¶ÈÊÇÕıµÄÄÇÃ´£¬ÄÇÃ´ÕıÊıµÄÔ­Âë¾ÍÊÇ²¹ÂëËü±¾Éí
		temp=tp*0.0625*100+0.5;	
		//ÁôÁ½¸öĞ¡Êıµã¾Í*100£¬+0.5ÊÇËÄÉáÎåÈë£¬ÒòÎªCÓïÑÔ¸¡µãÊı×ª»»ÎªÕûĞÍµÄÊ±ºò°ÑĞ¡Êıµã
		//ºóÃæµÄÊı×Ô¶¯È¥µô£¬²»¹ÜÊÇ·ñ´óÓÚ0.5£¬¶ø+0.5Ö®ºó´óÓÚ0.5µÄ¾ÍÊÇ½ø1ÁË£¬Ğ¡ÓÚ0.5µÄ¾Í
		//Ëã¼ÓÉÏ0.5£¬»¹ÊÇÔÚĞ¡ÊıµãºóÃæ¡£
	}
	datas[0] = temp / 10000;
	datas[1] = temp % 10000 / 1000;
	datas[2] = temp % 1000 / 100;
	datas[3] = temp % 100 / 10;
	datas[4] = temp % 10;
	
	LcdShowStr(star_add + 0x0f,0,"C");	
	LcdWriteCom(0x80 + star_add + 0x09);		  //Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('0'+datas[0]); //°ÙÎ» 
	SBUF = '0'+datas[0];//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
	while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
	TI = 0;
	
	LcdWriteCom(0x80 + star_add + 0x0a);		 //Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('0'+datas[1]); //Ê®Î»
	SBUF = '0'+datas[1];//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
	while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
	TI = 0;

	LcdWriteCom(0x80 + star_add + 0x0b);		//Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('0'+datas[2]); //¸öÎ» 
	SBUF = '0'+datas[2];//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
	while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
	TI = 0;

	LcdWriteCom(0x80 + star_add + 0x0c);		//Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('.'); 		//ÏÔÊ¾ ¡®.¡¯
	SBUF = '.';//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
	while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
	TI = 0;

	LcdWriteCom(0x80 + star_add + 0x0d);		 //Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('0'+datas[3]); //ÏÔÊ¾Ğ¡Êıµã  
	SBUF = '0'+datas[3];//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
	while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
	TI = 0;

	LcdWriteCom(0x80 + star_add + 0x0e);		 //Ğ´µØÖ· 80±íÊ¾³õÊ¼µØÖ·
	LcdWriteData('0'+datas[4]); //ÏÔÊ¾Ğ¡Êıµã 
	SBUF = '0'+datas[4];//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
	while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
	TI = 0;
	for(i=0; i<6; i++)
	{
	 	SBUF = CNCHAR[i];//½«½ÓÊÕµ½µÄÊı¾İ·ÅÈëµ½·¢ËÍ¼Ä´æÆ÷
		while (!TI);			         //µÈ´ı·¢ËÍÊı¾İÍê³É
		TI = 0;
	}

	 
}

